Repository: eng-mwaweza/Global-agency
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr, sw

source: Home
ar: الصفحة الرئيسية
fr: Accueil
sw: Nyumbani

source: About Us
ar: من نحن
fr: À propos de nous
sw: Kuhusu Sisi

source: Services
ar: الخدمات
sw: Huduma

source: Universities
ar: الجامعات
fr: Universités
sw: Chuo Kikuu

source: TCU Services
ar: خدمات TCU
fr: Services TCU
sw: Huduma za TCU

source: Success Stories
ar: قصص النجاح
fr: Histoires de réussite
sw: Hadithi za Mafanikio

source: Book Free Consult
ar: احجز استشارة مجانية
fr: Réserver une consultation gratuite
sw: Kumkaribisha Bure

source: Education for a Bright Tomorrow — Explore • Dream • Discover
ar: التعليم لغد مشرق — استكشف • احلم • اكتشف
fr: L'éducation pour un demain brillant — Explorez • Rêvez • Découvrez
sw: Elimu kwa Kesho Angavu — Chunguza • Pangiania • Gundua

source: Africa Western Education Company Ltd
ar: شركة التعليم الغربية الأفريقية المحدودة
fr: Société d'éducation occidentale africaine
sw: Kampuni ya Elimu Magharibi Barani Afrika

source: Your Gateway
ar: بوابتك
fr: Votre passerelle
sw: Njia Yako

source: to Global Education
ar: إلى التعليم العالمي
fr: vers l'éducation mondiale
sw: kwa Elimu Duniani

source: We provide end-to-end expert guidance — from application processing and scholarship hunting to visa preparation and pre-departure support.
ar: نحن نقدم إرشادات خبيرة شاملة — من معالجة الطلبات والبحث عن المنح الدراسية إلى تحضير التأشيرات والدعم قبل المغادرة.
fr: Nous fournissons des conseils d'experts complets — du traitement des demandes à la préparation des visas et au soutien avant le départ.
sw: Tunatoa mwongozo wa kina — kutoka kwa kusindika maombi hadi kuandaa visa na usaidizi kabla ya kuondoka.

source: Start Your Free Consultation
ar: ابدأ استشارتك المجانية
fr: Commencez votre consultation gratuite
sw: Anza Ushauri Wako Bure

source: Explore Our Services
ar: استكشف خدماتنا
fr: Explorez nos services
sw: Gundua Huduma Zetu

source: Students Placed Abroad
ar: الطلاب الموضوعون بالخارج
fr: Étudiants placés à l'étranger
sw: Wanafunzi Walioingizwa Nje

source: Partner Universities
ar: الجامعات الشريكة
fr: Universités partenaires
sw: Chuo Kikuu Shirikishi

source: Visas Assisted
ar: التأشيرات المساعدة
fr: Visas assistés
sw: Visa Zilizosadikiwa

source: Local Students Served
ar: الطلاب المحليين الذين تم خدمتهم
fr: Étudiants locaux servis
sw: Wanafunzi wa Ndani Waliotumikiwa

source: Trusted Worldwide
ar: موثوق عالميًا
fr: Approuvé mondialement
sw: Kutegemewa Kote Duniani

source: Recommended By
ar: الموصى به من
fr: Recommandé par
sw: Ilipendekeza na

source: Leading Organizations
ar: المنظمات الرائدة
fr: Organisations de premier plan
sw: Mashirika Yanayoongoza

source: Verified & Licensed
ar: تحقق من صحته ورخص
fr: Vérifié et autorisé
sw: Kuthibitishwa & Leseni

source: 5-Star Rated
ar: التصنيف 5 نجوم
fr: Noté 5 étoiles
sw: Ukadiriaji wa Nyota 5

source: Award Winning
ar: الحائز على جوائز
fr: Primé
sw: Kushinda Tuzo

source: Guidance & Selection
ar: التوجيه والاختيار
fr: Orientation et sélection
sw: Mwongozo & Chaguo

source: Visa & Passport
ar: التأشيرة والجواز
fr: Visa et passeport
sw: Visa & Pasipoti

source: Scholarship Assistance
ar: مساعدة المنح الدراسية
fr: Aide aux bourses d'études
sw: Msaada wa Kuzamia

source: View All Services
ar: عرض جميع الخدمات
fr: Voir tous les services
sw: Angalia Huduma Zote

source: Local Universities
ar: الجامعات المحلية
fr: Universités locales
sw: Vyuo Vikuu vya Ndani

source: International Universities
ar: الجامعات الدولية
fr: Universités internationales
sw: Chuo Kikuu cha Kimataifa

source: USA Universities
ar: جامعات الولايات المتحدة
fr: Universités américaines
sw: Chuo Kikuu cha USA

source: UK Universities
ar: جامعات المملكة المتحدة
fr: Universités britanniques
sw: Chuo Kikuu cha UK

source: Canada Universities
ar: جامعات كندا
fr: Universités canadiennes
sw: Chuo Kikuu cha Canada

source: View All Countries
ar: عرض جميع الدول
fr: Voir tous les pays
sw: Angalia Nchi Zote

source: Study at World-Class Universities Abroad
ar: الدراسة في جامعات عالمية الطراز بالخارج
fr: Étudier dans des universités de classe mondiale à l'étranger
sw: Soma katika Chuo Kikuu cha Clasi ya Dunia Nje

source: United States
ar: الولايات المتحدة
fr: États-Unis
sw: Marekani

source: United Kingdom
ar: المملكة المتحدة
fr: Royaume-Uni
sw: Uingereza

source: Canada
ar: كندا
sw: Kanada

source: Australia
ar: أستراليا
fr: Australie

source: Germany
ar: ألمانيا
fr: Allemagne
sw: Ujerumani

source: More
ar: أكثر
fr: Plus
sw: Zaidi

source: Top Universities
ar: أفضل الجامعات
fr: Meilleures universités
sw: Chuo Kikuu cha Juu

source: Worldwide
ar: في جميع أنحاء العالم
fr: Mondial
sw: Kote Duniani

source: Countries
ar: الدول
fr: Pays
sw: Nchi

source: Most In-Demand Programs
ar: البرامج الأكثر طلبًا
fr: Programmes les plus demandés
sw: Programu Zinazohitajika Zaidi

source: Top
ar: أعلى
fr: Meilleur
sw: Juu

source: Courses
ar: الدورات
fr: Cours
sw: Kozi

source: in High Demand
ar: في طلب مرتفع
fr: en forte demande
sw: katika Mahitaji Makubwa

source: Computer Science / IT
ar: علوم الحاسوب / تكنولوجيا المعلومات
fr: Informatique / TI
sw: Sayansi ya Kompyuta / IT

source: Business & Management
ar: الأعمال والإدارة
fr: Affaires et gestion
sw: Biashara & Usimamizi

source: Healthcare & Medicine
ar: الرعاية الصحية والطب
fr: Santé et médecine
sw: Huduma za Afya & Dawa

source: Engineering
ar: الهندسة
fr: Ingénierie
sw: Uhandisi

source: Data Science & AI
ar: علوم البيانات والذكاء الاصطناعي
fr: Science des données et IA
sw: Sayansi ya Data & AI

source: Law & Legal Studies
ar: القانون والدراسات القانونية
fr: Droit et études juridiques
sw: Sheria & Masomo ya Kisheria

source: Learn More
ar: تعرف على المزيد
fr: En savoir plus
sw: Jifunza Zaidi

source: Get Free Course Consultation
ar: احصل على استشارة دورة مجانية
fr: Obtenir une consultation de cours gratuite
sw: Pata Ushauri wa Kozi Bure

source: Contact Us
ar: اتصل بنا
fr: Nous contacter
sw: Wasiliana Nasi

source: Student Portal
ar: بوابة الطالب
fr: Portail Étudiant
sw: Kituo cha Wanafunzi

source: Create Account Now
ar: إنشاء حساب الآن
fr: Créer un compte maintenant
sw: Fungua Akaunti Sasa

source: Who We Are
ar: من نحن
fr: Qui sommes-nous
sw: Kuhusu Sisi

source: Leading the Way in International Education Counseling.
ar: الرائدة في مجال الاستشارات التعليمية الدولية.
fr: Leader en matière de conseil en éducation internationale.
sw: Tunaongoza katika Ushauri wa Elimu ya Kimataifa.

source: Founded in 2020 and launched in 2024, Africa Western Education Company Ltd is a professional educational consultancy empowering African students and professionals with reliable, transparent, and high-quality advisory services. We connect you to global learning opportunities while simplifying admissions, scholarship applications, and visa processes.
ar: تأسست عام 2020 وأطلقت في عام 2024، شركة Africa Western Education Company Ltd هي شركة استشارات تعليمية احترافية تمكن الطلاب والمحترفين الأفارقة من خلال خدمات استشارية موثوقة وشفافة وعالية الجودة. نحن نربطك بفرص التعلم العالمية مع تبسيط عمليات القبول وطلبات المنح الدراسية ومعالجات التأشيرات.
fr: Fondée en 2020 et lancée en 2024, Africa Western Education Company Ltd est une entreprise de conseil en éducation professionnelle qui autonomise les étudiants et les professionnels africains grâce à des services consultatifs fiables, transparents et de haute qualité. Nous vous connectons à des opportunités d'apprentissage mondiales tout en simplifiant les processus d'admission, les demandes de bourses et les procédures de visa.
sw: Kampuni yetu ilianzishwa mwaka 2020 na kuanza rasmi utendaji mwaka 2024. Africa Western Education Company Ltd ni kampuni ya ushauri wa elimu ya kitaalam inayowasaidia wanafunzi na wataalamu wa Kiafrika kupata fursa za masomo kimataifa kwa njia ya ushauri wa kuaminika, wenye uwazi na ubora wa hali ya juu. Tunakuunganisha na fursa za masomo ulimwenguni kote huku tukiwezesha mchakato wa maombi ya vyuo, ufadhili na visa.

source: Our Mission
ar: مهمتنا
fr: Notre Mission
sw: Dhamira Yetu

source: To empower African students and professionals by providing reliable, transparent, and high-quality educational consultancy services that connect them to global learning opportunities.
ar: تمكين الطلاب والمحترفين الأفارقة من خلال تقديم خدمات استشارية تعليمية موثوقة وشفافة وعالية الجودة تربطهم بفرص التعلم العالمية.
fr: Autonomiser les étudiants et les professionnels africains en fournissant des services de conseil en éducation fiables, transparents et de haute qualité qui les relient à des opportunités d'apprentissage mondiales.
sw: Kuwapa nguvu wanafunzi na wataalamu wa Kiafrika kwa kutoa huduma za ushauri wa elimu zinazotegemeka, zenye uwazi na ubora wa hali ya juu ambazo zinawaunganisha na fursa za masomo kimataifa.

source: Our Vision
ar: رؤيتنا
fr: Notre Vision
sw: Dira Yetu

source: To become Africa's leading and most trusted educational consultancy, shaping futures through global academic access and excellence.
ar: أن تصبح شركة الاستشارات التعليمية الرائدة والأكثر ثقة في أفريقيا، تشكل المستقبل من خلال الوصول الأكاديمي العالمي والتميز.
fr: Devenir la première et la plus fiable entreprise de conseil en éducation en Afrique, façonnant l'avenir grâce à l'accès académique mondial et l'excellence.
sw: Kuwa kampuni ya ushauri wa elimu inayoongoza na kuaminika zaidi Afrika, tukijenga mustakabali kupitia upatikanaji wa elimu ya kimataifa na ubora.

source: The Pillars of Our Success
ar: أعمدة نجاحنا
fr: Les piliers de notre succès
sw: Misingi ya Mafanikio Yetu

source: Integrity
ar: النزاهة
fr: Intégrité
sw: Uadilifu

source: We uphold honesty, transparency, and ethical standards in all our services and interactions.
ar: نحن نتمسك بالصدق والشفافية والمعايير الأخلاقية في جميع خدماتنا والتفاعلات.
fr: Nous défendons l'honnêteté, la transparence et les normes éthiques dans tous nos services et nos interactions.
sw: Tunashikilia uaminifu, uwazi na viwango vya maadili katika huduma zetu zote na mwingiliano wetu.

source: Innovation
ar: الابتكار
sw: Ubunifu

source: We embrace creativity and continuously improve our services with new methods and technologies.
ar: نحن نتبنى الإبداع ونحسن خدماتنا باستمرار بطرق وتقنيات جديدة.
fr: Nous embrassons la créativité et améliorons continuellement nos services avec de nouvelles méthodes et technologies.
sw: Tunakubali ubunifu na kuboresha huduma zetu mara kwa mara kwa mbinu na teknolojia mpya.

source: Excellence
ar: التميز
sw: Ubora

source: We are committed to delivering the highest quality of service and achieving outstanding results for our clients.
ar: نحن ملتزمون بتقديم أعلى جودة من الخدمة وتحقيق نتائج استثنائية لعملائنا.
fr: Nous nous engageons à fournir la plus haute qualité de service et à obtenir des résultats exceptionnels pour nos clients.
sw: Tumejitolea kutoa huduma bora zaidi na kufikia matokeo bora kwa wateja wetu.

source: Customer Focus
ar: التركيز على العميل
fr: Orientation client
sw: Kuzingatia Wateja

source: Our clients are at the center of everything we do; we prioritize their needs and ensure satisfaction.
ar: عملاؤنا في مركز كل ما نفعله؛ نعطي الأولوية لاحتياجاتهم ونضمن الرضا.
fr: Nos clients sont au centre de tout ce que nous faisons; nous prioritorisons leurs besoins et assurons la satisfaction.
sw: Wateja wetu ni kipaumbele chetu; tunaweka mahitaji yao mbele na kuhakikisha kuridhika kwao.

source: Accountability
ar: المساءلة
fr: Responsabilité
sw: Uwajibikaji

source: We take full responsibility for our actions and outcomes, ensuring reliability and trustworthiness.
ar: نحن نتحمل المسؤولية الكاملة عن أفعالنا ونتائجنا، مما يضمن الموثوقية والجدارة بالثقة.
fr: Nous assumons la responsabilité complète de nos actions et de nos résultats, assurant la fiabilité et la confiance.
sw: Tunachukua jukumu kamili la vitendo vyetu na matokeo yake, tukihakikisha kutegemeka na kuaminika.

source: Teamwork
ar: العمل الجماعي
fr: Travail d'équipe
sw: Ushirikiano

source: We foster collaboration and cooperation within our team and with partners to achieve common goals.
ar: نحن نعزز التعاون والعمل الجماعي داخل فريقنا وشركائنا لتحقيق أهداف مشتركة.
fr: Nous favorisons la collaboration et la coopération au sein de notre équipe et avec nos partenaires pour atteindre des objectifs communs.
sw: Tunaimarisha ushirikiano na kazi ya pamoja ndani ya timu yetu na na washirika wetu ili kufikia malengo yetu ya pamoja.

source: Our Comprehensive Services
ar: خدماتنا الشاملة
fr: Nos services complets
sw: Huduma Zetu Kamili

source: End-to-End Study Abroad Support
ar: دعم الدراسة بالخارج من النهاية إلى النهاية
fr: Soutien complet pour étudier à l'étranger
sw: Msaada Kamili wa Kusoma Nje ya Nchi

source: From initial guidance to post-arrival support, we handle every aspect of your study abroad journey with expert care.
ar: من التوجيه الأولي إلى الدعم بعد الوصول، نتعامل مع كل جوانب رحلة الدراسة بالخارج بعناية متخصصة.
fr: Du guidage initial au soutien post-arrivée, nous gérons chaque aspect de votre parcours d'études à l'étranger avec un soin expert.
sw: Kutoka mwongozo wa awali hadi msaada baada ya kuwasili, tunashughulikia kila kipengele cha safari yako ya masomo nje ya nchi kwa utaalamu na uzoefu.

source: How We Help:
ar: كيف نساعد:
fr: Comment nous aidons:
sw: Jinsi Tunavyosaidia:

source: Personalized Profile Analysis:
ar: تحليل الملف الشخصي المخصص:
fr: Analyse du profil personnalisé:
sw: Uchambuzi wa Wasifu wa Kibinafsi:

source: Comprehensive assessment of academic background, interests, and career goals
ar: تقييم شامل للخلفية الأكاديمية والاهتمامات والأهداف الوظيفية
fr: Évaluation complète des antécédents scolaires, des intérêts et des objectifs professionnels
sw: Tathmini kamili ya historia ya masomo, mapenzi na malengo ya kazi

source: University Shortlisting:
ar: قائمة جامعات مختصرة:
fr: Liste raccourcie des universités:
sw: Uchaguzi wa Vyuo Vikuu:

source: Curated list of universities matching your profile and budget
ar: قائمة منسقة من الجامعات التي تطابق ملفك الشخصي وميزانيتك
fr: Liste sélectionnée d'universités correspondant à votre profil et à votre budget
sw: Orodha iliyochaguliwa ya vyuo vikuu vinavyoendana na wasifu na bajeti yako

source: Course Selection:
ar: اختيار الدورة:
fr: Sélection des cours:
sw: Kuchagua Kozi:

source: Expert guidance on program choices with best career prospects
ar: التوجيه الخبير بشأن اختيار البرنامج مع أفضل آفاق مهنية
fr: Orientation d'experts sur les choix de programmes avec les meilleures perspectives de carrière
sw: Ushauri wa kitaalamu juu ya uchaguzi wa programu zenye fursa bora za kazi

source: Career Pathway Planning:
ar: تخطيط المسار الوظيفي:
fr: Planification du parcours professionnel:
sw: Kupanga Njia ya Kazi:

source: Long-term career strategy aligned with your chosen course
ar: استراتيجية وظيفية طويلة الأجل متوافقة مع الدورة التي اخترتها
fr: Stratégie de carrière à long terme alignée avec le cours que vous avez choisi
sw: Mkakati wa muda mrefu wa kazi unaofanana na kozi uliyochagua

source: AFRICA WESTERN EDUCATION COMPANY LTD
ar: شركة التعليم الغربية الأفريقية المحدودة
fr: SOCIÉTÉ DE L'ÉDUCATION OCCIDENTALE AFRICAINE LTÉE
sw: KAMPUNI YA ELIMU YA MAGHARIBI YA AFRIKA

source: Empowering African students and professionals through reliable, transparent, and high-quality educational consultancy services.
ar: تمكين الطلاب والمحترفين الأفارقة من خلال خدمات الاستشارات التعليمية الموثوقة والشفافة والعالية الجودة.
fr: Autonomiser les étudiants et les professionnels africains grâce à des services de conseil en éducation fiables, transparents et de haute qualité.
sw: Tunawasaidia wanafunzi na wataalamu wa Kiafrika kupitia huduma za ushauri wa elimu zinazotegemeka, zenye uwazi na ubora wa hali ya juu.

source: Quick Links
ar: روابط سريعة
fr: Liens rapides
sw: Viungo vya Haraka

source: Study Abroad
ar: الدراسة بالخارج
fr: Étudier à l'étranger
sw: Soma Nje ya Nchi

source: Apply Now
ar: تقدم الآن
fr: Postulez maintenant
sw: Omba Sasa

source: Our Services
ar: خدماتنا
fr: Nos services
sw: Huduma Zetu

source: University Application Assistance
ar: مساعدة في تطبيق الجامعة
fr: Assistance de demande universitaire
sw: Msaada wa Maombi ya Chuo Kikuu

source: Visa Processing Support
ar: دعم معالجة التأشيرة
fr: Soutien au traitement des visas
sw: Msaada wa Kuchakata Visa

source: TCU Application Services
ar: خدمات تطبيق TCU
fr: Services de demande TCU
sw: Huduma za Maombi ya TCU

source: Pre-Departure Guidance
ar: التوجيه قبل المغادرة
fr: Orientation avant le départ
sw: Mwongozo wa Kabla ya Kusafiri

source: Dar es Salaam, Tanzania
ar: دار السلام، تنزانيا
fr: Dar es Salaam, Tanzanie

source: Mon-Fri: 8:00 AM - 6:00 PM
ar: الاثنين-الجمعة: 8:00 صباحًا - 6:00 مساءً
fr: Lun-Ven: 8:00 AM - 6:00 PM
sw: Jumatatu-Ijumaa: Saa 8:00 Asubuhi - 6:00 Jioni

source: Sat: 9:00 AM - 2:00 PM
ar: السبت: 9:00 صباحًا - 2:00 مساءً
fr: Sam: 9:00 AM - 2:00 PM
sw: Jumamosi: Saa 9:00 Asubuhi - 2:00 Mchana

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité
sw: Sera ya Faragha

source: Terms of Service
ar: شروط الخدمة
fr: Conditions de service
sw: Masharti ya Huduma

source: Employee Login
ar: دخول الموظف
fr: Connexion employé
sw: Kuingia kwa Wafanyakazi
